# InitialImperfectionOfPoint

Initial deformation of point - geometry nonlinear calculation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.initial_imperfection_of_point import InitialImperfectionOfPoint

# TODO update the JSON string below
json = "{}"
# create an instance of InitialImperfectionOfPoint from a JSON string
initial_imperfection_of_point_instance = InitialImperfectionOfPoint.from_json(json)
# print the JSON string representation of the object
print(InitialImperfectionOfPoint.to_json())

# convert the object into a dict
initial_imperfection_of_point_dict = initial_imperfection_of_point_instance.to_dict()
# create an instance of InitialImperfectionOfPoint from a dict
initial_imperfection_of_point_from_dict = InitialImperfectionOfPoint.from_dict(initial_imperfection_of_point_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)